Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: :cpp:func:`lv_opengles_egl_window_create` can be used to create a :cpp:type:`lv_opengles_window_t` which can be used with the same generic LVGL OpenGL APIs as a GLFW window.
it_it: :cpp:func:`lv_opengles_egl_window_create` può essere utilizzato per creare una :cpp:type:`lv_opengles_window_t` utilizzabile con le stesse API OpenGL generiche LVGL di una finestra GLFW.

source: :cpp:func:`lv_style_set_pad_column` sets padding between columns.
it_it: :cpp:func:`lv_style_set_pad_column` imposta la spaziatura interna tra le colonne.

source: :cpp:func:`lv_style_set_pad_row` sets padding between rows.
it_it: :cpp:func:`lv_style_set_pad_row` imposta la spaziatura interna tra le righe.

source: :cpp:func:`lv_tick_inc` (if writing to a ``uint32_t`` is atomic on your platform; see :ref:`tick_interface` for more information) and
it_it: :cpp:func:`lv_tick_inc` (se la scrittura su ``uint32_t`` è atomica sulla piattaforma; vedere :ref:`tick_interface` per maggiori informazioni) e

source: :cpp:func:`lv_tick_inc` is only one of two LVGL functions that may be called from an interrupt if writing to a ``uint32_t`` value is atomic on your platform.
it_it: :cpp:func:`lv_tick_inc` è solo una delle due funzioni LVGL che possono essere chiamate da un interrupt se la scrittura su un valore ``uint32_t`` è atomica sulla piattaforma.

source: :cpp:func:`lv_timer_create_basic` can also be used to create a new Timer without specifying any parameters.
it_it: :cpp:func:`lv_timer_create_basic` può anche essere utilizzato per creare un nuovo Timer senza specificare alcun parametro.

source: :cpp:func:`lv_timer_handler` and :cpp:func:`lv_display_refr_timer` must not run at the same time.
it_it: :cpp:func:`lv_timer_handler` e :cpp:func:`lv_display_refr_timer` non devono essere eseguiti contemporaneamente.

source: :cpp:func:`lv_timer_handler` should be called after something is created, deleted, or modified so that a refresh will be performed if necessary.
it_it: :cpp:func:`lv_timer_handler` dovrebbe essere chiamata dopo che qualcosa è stato creato, eliminato o modificato, in modo che venga eseguito un aggiornamento se necessario.

source: :cpp:func:`lv_timer_handler` will continue to return :c:macro:`LV_NO_TIMER_READY` until there is a running timer.
it_it: :cpp:func:`lv_timer_handler` continuerà a restituire :c:macro:`LV_NO_TIMER_READY` finché non ci sarà un timer in esecuzione.

source: :cpp:func:`lv_timer_handler` will return :c:macro:`LV_NO_TIMER_READY` (``UINT32_MAX``) if there are no running timers.
it_it: :cpp:func:`lv_timer_handler` restituirà :c:macro:`LV_NO_TIMER_READY` (``UINT32_MAX``) se non ci sono timer in esecuzione.

source: :cpp:func:`pxp_interrupt_deinit`: Deinitialize PXP interrupt (HW setup, OS setup)
it_it: :cpp:func:`pxp_interrupt_deinit`: Deinizializza l'interrupt PXP (configurazione HW, configurazione del sistema operativo)

source: :cpp:func:`pxp_interrupt_init`: Initialize PXP interrupt (HW setup, OS setup)
it_it: :cpp:func:`pxp_interrupt_init`: Inizializza l'interrupt PXP (configurazione HW, configurazione del sistema operativo)

source: :cpp:func:`pxp_run`: Start PXP job.
it_it: :cpp:func:`pxp_run`: Avvia il job PXP.

source: :cpp:func:`pxp_wait`: Wait for PXP completion.
it_it: :cpp:func:`pxp_wait`: Attende il completamento di PXP.

source: :cpp:member:`color`: for color properties
it_it: :cpp:member:`color`: per le proprietà relative al colore

source: :cpp:member:`num`: for integer, boolean and opacity properties
it_it: :cpp:member:`num`: per le proprietà intere, booleane e di opacità

source: :cpp:member:`ptr`: for pointer properties
it_it: :cpp:member:`ptr`: per le proprietà relative al puntatore

source: :cpp:type:`lv_anim_t` contains ``user_data`` field.
it_it: :cpp:type:`lv_anim_t` contiene il campo ``user_data``.

source: :cpp:type:`lv_draw_rect_dsc_t` is a helper descriptor that combines:
it_it: :cpp:type:`lv_draw_rect_dsc_t` è un descrittore di supporto che combina:

source: :cpp:type:`lv_event_t` is the only parameter passed to the event callback and it contains all data about the event.
it_it: :cpp:type:`lv_event_t` è l'unico parametro passato alla callback dell'evento e contiene tutti i dati relativi all'evento.

source: :cpp:type:`lv_image_dsc_t` object + data in ROM or RAM
it_it: :cpp:type:`lv_image_dsc_t` object + data in ROM o RAM

source: :cpp:type:`lv_prop_id_t` :cpp:expr:`lv_obj_class_property_get_id(class_p, name)` Gets property ID by doing a non-recursive search for ``name`` directly in Widget class properties.
it_it: :cpp:type:`lv_prop_id_t` :cpp:expr:`lv_obj_class_property_get_id(class_p, name)` Ottiene l'ID della proprietà eseguendo una ricerca non ricorsiva per ``name`` direttamente nelle proprietà della classe Widget.

source: :cpp:type:`lv_prop_id_t` :cpp:expr:`lv_obj_property_get_id(widget, name)` Gets property ID by recursively searching for ``name`` in Widget's class hierarchy, and if still not found, then searches style properties.
it_it: :cpp:type:`lv_prop_id_t` :cpp:expr:`lv_obj_property_get_id(widget, name)` Ottiene l'ID proprietà cercando ricorsivamente ``name`` nella gerarchia di classi del Widget e, se non viene trovato, cerca le proprietà di stile.

source: :cpp:type:`lv_prop_id_t` :cpp:expr:`lv_style_property_get_id(name)` Gets style property ID by name.
it_it: :cpp:type:`lv_prop_id_t` :cpp:expr:`lv_style_property_get_id(name)` Ottiene l'ID della proprietà di stile in base al nome.

source: :cpp:type:`lv_prop_id_t` identifies which property to get/set.
it_it: :cpp:type:`lv_prop_id_t` identifica la proprietà da ottenere/impostare.

source: :cpp:type:`lv_property_t` :cpp:expr:`lv_obj_get_property(widget, lv_prop_id_t id)` Reads property value from Widget.
it_it: :cpp:type:`lv_property_t` :cpp:expr:`lv_obj_get_property(widget, lv_prop_id_t id)` Legge il valore della proprietà dal Widget.

source: :cpp:type:`lv_property_t` is a struct that begins with an ``id`` field whose meaning is the same as property ID described above, paired with a value, which is a union of all possible property types including integer, pointer and color.
it_it: :cpp:type:`lv_property_t` è una struttura che inizia con un campo ``id`` il cui significato è lo stesso dell'ID della proprietà descritto sopra, abbinato a un valore, che è un'unione di tutti i possibili tipi di proprietà, inclusi intero, puntatore e colore.

source: :cpp:type:`lv_result_t` :cpp:expr:`lv_obj_set_properties(widget, lv_property_t * values, count)` Sets multiple Widget properties from an array of :cpp:type:`lv_property_t`.
it_it: :cpp:type:`lv_result_t` :cpp:expr:`lv_obj_set_properties(widget, lv_property_t * values, count)` Imposta più proprietà Widget da un array di :cpp:type:`lv_property_t`.

source: :cpp:type:`lv_result_t` :cpp:expr:`lv_obj_set_property(widget, lv_property_t * value)` Sets specified property of Widget.
it_it: :cpp:type:`lv_result_t` :cpp:expr:`lv_obj_set_property(widget, lv_property_t * value)` Imposta la proprietà specificata del Widget.

source: :cpp:type:`lv_style_t` objects can be shared among Sections and among PARTs, but unlike normal Styles added to a Widget, a Section can only have 1 style per PART.
it_it: Gli oggetti :cpp:type:`lv_style_t` possono essere condivisi tra le Sezioni e tra le PARTI, ma a differenza dei normali Stili aggiunti a un Widget, una Sezione può avere solo 1 stile per PARTE.

source: :cpp:union:`lv_style_value_t` has 3 fields, only one of which will apply, depending on the type of property it is applied to:
it_it: :cpp:union:`lv_style_value_t` ha 3 campi, di cui solo uno verrà applicato, a seconda del tipo di proprietà a cui viene applicato:

source: :dfn:`Components` are simpler UI elements and **can be loaded at runtime**.
it_it: I :dfn:`Components` sono elementi dell'interfaccia utente più semplici e **possono essere caricati a runtime**.

source: :dfn:`Screens` are similar to Components:
it_it: Gli :dfn:`Screen` [schermate] sono simili ai Componenti:

source: :dfn:`Widgets` are the core building blocks of the UI and are **not meant to be loaded at runtime** but rather compiled into the application as C code.
it_it: I :dfn:`Widget` sono i componenti fondamentali dell'interfaccia utente e **non sono pensati per essere caricati in fase di esecuzione**, ma piuttosto compilati nell'applicazione come codice C.

source: :maxdepth: 2 <=== Internal use and needs to always be set this way
it_it: :maxdepth: 2 <=== Uso interno e deve essere sempre impostato in questo modo

source: :ref:`<api> <xml_api>`: Screens are always created as they are, with no parameters.
it_it: :ref:`<api> <xml_api>`: Gli Screen vengono sempre creati così come sono, senza parametri.

source: :ref:`<preview> <xml_preview>`: In LVGL's UI Editor, ``<preview>`` is used to set the style, size, and other parameters of the previewing "screen".
it_it: :ref:`<preview> <xml_preview>`: Nell'UI Editor di LVGL', ``<preview>`` viene utilizzato per impostare lo stile, le dimensioni e altri parametri della "schermata" di anteprima.

source: :ref:`Arc Events <lv_arc_events>`
it_it: :ref:`Eventi di Arc <lv_arc_events>`

source: :ref:`Arduino Framework <arduino>`
it_it: :ref:`Framework Arduino <arduino>`

source: :ref:`Arm2D <arm2d>` is a library maintained by Arm that leverages the Helium instruction set.
it_it: :ref:`Arm2D <arm2d>` è una libreria gestita da Arm che sfrutta il set di istruzioni Helium.

source: :ref:`Bar Events <lv_bar_events>`.
it_it: :ref:`Eventi della Bar <lv_bar_events>`.

source: :ref:`Cached reading <file_system_cache>` is also supported if ``LV_FS_..._CACHE_SIZE`` is set to a non-zero value.
it_it: Il :ref:`Cached reading <file_system_cache>` è supportato anche se ``LV_FS_..._CACHE_SIZE`` è impostato su un valore diverso da zero.

source: :ref:`Children <obj_tree>`
it_it: :ref:`Figli <obj_tree>`

source: :ref:`DMA2D: asynchronous pixel data memory operations.
it_it: :ref:`DMA2D: operazioni di memoria dati pixel asincrone.

source: :ref:`Data bindings <observer>`
it_it: :ref:`Data binding <observer>`

source: :ref:`Drawing <draw>` to learn more about how rendering works in LVGL.
it_it: :ref:`Drawing <draw>` per saperne di più sul funzionamento del rendering in LVGL.

source: :ref:`Events <events>`
it_it: :ref:`Eventi <events>`

source: :ref:`Flags <lv_obj_flags>`
it_it: :ref:`Flag <lv_obj_flags>`

source: :ref:`Flex <flex>` and :ref:`Grid <grid>` layouts can automatically position widgets in rows, columns, or 2D grids.
it_it: I layout :ref:`Flex <flex>` e :ref:`Grid <grid>` possono posizionare automaticamente i widget in righe, colonne o griglie 2D.

source: :ref:`Image <lv_image>` Widgets can be opened from files as well (besides variables stored in the compiled program).
it_it: I Widget :ref:`Image <lv_image>` possono essere aperti anche da file (oltre che dalle variabili memorizzate nel programma compilato).

source: :ref:`Integration Overview <adding_lvgl_to_your_project>` or check out the `ready-to-use Projects`_.
it_it: Consultare :ref:`Panoramica dell'Integrazione <adding_lvgl_to_your_project>` o vedere nei `ready-to-use Projects`_.

source: :ref:`LTDC: display controller.
it_it: :ref:`LTDC: controller del display.

source: :ref:`Layouts <layouts>`
it_it: :ref:`Layout <layouts>`

source: :ref:`NeoChrom: GPU for rendering 2D graphics primitives.
it_it: :ref:`NeoChrom: GPU per il rendering di primitive grafiche 2D.

source: :ref:`OS <threading>`, external memory and :ref:`GPU <draw>` are supported but not required
it_it: :ref:`OS <threading>`, memoria esterna e :ref:`GPU <draw>` sono supportati ma non obbligatori

source: :ref:`Parts and States <widget_parts_and_states>`
it_it: :ref:`Parti e Stati <widget_parts_and_states>`

source: :ref:`Position and Size <coord>`
it_it: :ref:`Posizione e Dimensione <coord>`

source: :ref:`See below <chart_update_modes>`
it_it: :ref:`Vedere di seguito <chart_update_modes>`

source: :ref:`See this guide for creating an SPI display driver.
it_it: :ref:`Consulta questa guida per creare un driver per display SPI.

source: :ref:`Simulator <simulator>` to start embedded GUI design on a PC without embedded hardware
it_it: :ref:`Simulatore <simulator>` per avviare la progettazione di GUI embedded su un PC senza hardware integrato

source: :ref:`Styles <styles>`
it_it: :ref:`Stili <styles>`

source: :ref:`Styles <xml_styles>`, :ref:`Constants <xml_consts>`, and :ref:`custom API <component_custom_api>` can also be described in the XML files.
it_it: :ref:`Stili <xml_styles>`, :ref:`Costanti <xml_consts>` e :ref:`API custom <component_custom_api>` possono essere descritti anche nei file XML.

source: :ref:`Support 2D Direct Memory Access (DMA2D) <esp_dma2d>`
it_it: :ref:`Supporto per la Direct Memory Access 2D (DMA2D) <esp_dma2d>`

source: :ref:`Support for Pixel Processing Accelerator <esp_ppa>`
it_it: :ref:`Supporto per il Pixel Processing Accelerator <esp_ppa>`

source: :ref:`Textarea Events <lv_textarea_events>`.
it_it: :ref:`Eventi della Textarea <lv_textarea_events>`.

source: :ref:`acquired LVGL <getting_lvgl>`,
it_it: :ref:`acquisito LVGL <getting_lvgl>`,

source: :ref:`build_cmake` support
it_it: Supporto per :ref:`build_cmake`

source: :ref:`create an lv_display_t <creating_a_display>` object for it,
it_it: :ref:`creargli un oggetto lv_display_t <creating_a_display>`,

source: :ref:`created a lv_conf.h file <lv_conf>` for your project,
it_it: :ref:`creato un file lv_conf.h <lv_conf>` per il progetto,

source: :ref:`event callbacks <events>`, and in
it_it: :ref:`callback di eventi <events>` e nelle

source: :ref:`file_system` path to file (e.g. JPG, PNG, BMP etc.)
it_it: :ref:`file_system` path al file (p. es. JPG, PNG, BMP ecc.)

source: :ref:`flash_the_image` and run the benchmark application on the board.
it_it: :ref:`flash_the_image` ed eseguire l'applicazione di benchmark sulla board.

source: :ref:`lv_timer <timer>`, a subject with a special observer, complex animations, or styles can be added in ``ui.c`` or the C file created from ``globals.xml``.
it_it: :ref:`lv_timer <timer>`, un oggetto con un "observer" speciale, animazioni complesse o stili può essere aggiunto in ``ui.c`` o nel file C creato da ``globals.xml``.

source: :ref:`manually create images <images_manually_creating>`
it_it: :ref:`immagini create manualmente <images_manually_creating>`

source: :ref:`timer callbacks <timer>`
it_it: :ref:`callback del timer <timer>`

source: <=== Empty line -- important!
it_it: <=== Riga vuota -- importante!

source: <=== any text introducing this topic and the TOC below ..
it_it: <=== qualsiasi testo che introduca questo argomento e il Sommario sottostante ..

source: <=== blank line here is important
it_it: <=== la riga vuota qui è importante

source: <=== blank line here is important - If you want to have nested bulleted lists, indent each
it_it: <=== la riga vuota qui è importante - Per avere elenchi puntati nidificati, rientrare ogni

source: <=== blank line here is important - Last list item.
it_it: <=== la riga vuota qui è importante - Ultimo elemento di elenco.

source: <div class='lv-example-container'><div class='lv-example-description'>A simple example to demonstrate the use of an animation image.</div></div>
it_it: <div class='lv-example-container'><div class='lv-example-description'>Un semplice esempio per mostrare l'uso di un'immagine animata.</div></div>

source: <div class='lv-example-container'><div class='lv-example-description'>A simple example to demonstrate the use of an arc label.</div></div>
it_it: <div class='lv-example-container'><div class='lv-example-description'>Un semplice esempio per mostrare l'uso di una label arco.</div></div>

source: <div class='lv-example-container'><div class='lv-example-description'>A simple example to demonstrate the use of an arc.</div></div>
it_it: <div class='lv-example-container'><div class='lv-example-description'>Un semplice esempio per mostrare l'uso di un arco.</div></div>

source: ====, ****, ---- are encouraged.
it_it: ====, ****, ---- sono consigliati.

source: Configuration
it_it: Configurazione

source: Directives ∙ Admonitions
it_it: Direttive ∙ Avvertenze

source: Directives
it_it: Direttive

source: Examples
it_it: Esempi

source: Furo-theme Examples
it_it: Esempi del tema Furo

source: Glossary
it_it: Glossario

source: Interpreted Text Roles
it_it: Ruoli del Testo Interpretato

source: Introduction
it_it: Introduzione

source: Kitchen Sink Page
it_it: Pagina Riassuntiva

source: Markup Specification ∙ Substitution References
it_it: Specifiche di Markup ∙ Riferimenti di Sostituzione

source: Markup Specification ∙ Tables
it_it: Specifiche di markup ∙ Tabelle

source: Markup Specification
it_it: Specifiche di Markup

source: Quick Reference
it_it: Guida Rapida

source: Quickstart
it_it: Guida Rapida

source: Referencing
it_it: Riferimenti

source: Sphinx Themes Gallery
it_it: Galleria dei Temi Sphinx

source: unique_anchor_name may appear in places other than before a heading, but if so, custom link text (like "here" the first example above) must be provided.
it_it: unique_anchor_name può apparire anche in punti diversi da prima di un'intestazione, ma in tal caso è necessario fornire un testo personalizzato per il link (come "qui" nel primo esempio sopra).

source: unique_anchor_name must be unique throughout all .rst files under ./docs/src/.
it_it: unique_anchor_name deve essere univoco in tutti i file .rst in ./docs/src/.

source: |nbhyph| (non-breaking hyphen used in titles and official names)
it_it: |nbhyph| (trattino unificatore utilizzato nei titoli e nei nomi ufficiali)

source: |nbsp| (non-breaking space),
it_it: |nbsp| (spazio unificatore),

source: |shy| (soft hyphen), and
it_it: |shy| (trattino morbido) e

source: ~~~~ only if really needed.
it_it: ~~~~ solo se realmente necessario.

source: Contributing
it_it: Contribuire

source: Getting Started
it_it: Per Iniziare

source: Going deeper
it_it: Approfondimento

source: Integrating LVGL into Your Project
it_it: Integrare LVGL al Proprio Progetto

source: Widgets
it_it: Widget

source: <p>Be part of LVGL's development.</p>
it_it: <p>Partecipare allo sviluppo di LVGL.</p>

source: <p>Get familiar with LVGL.</p>
it_it: <p>Familiarizzare con LVGL.</p>

source: <p>Get your feet wet with LVGL.</p>
it_it: <p>Iniziare a usare LVGL.</p>

source: <p>Learn how LVGL works.</p>
it_it: <p>Scoprire come funziona LVGL.</p>

source: <p>Learn how to add LVGL to your project for any platform, framework and display type.</p>
it_it: <p>Scoprire come aggiungere LVGL al progetto per qualsiasi piattaforma, framework e tipo di display.</p>

source: <p>Learn to use LVGL Widgets with examples.</p>
it_it: <p>Imparare a usare i widget LVGL con Esempi.</p>

source: <span>&#x04E2D;&#x02F42;</span> Chinese Translation
it_it: <span>&#x04E2D;&#x02F42;</span> Traduzione Cinese

source: <ul> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Default</strong> 0</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Inherited</strong> No</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Layout</strong> Yes</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Ext.
it_it: <ul> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Default</strong> 0</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Ereditato</strong> No</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Layout</strong> Sì</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Ext.

source: <ul> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Default</strong> Widget dependent</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Inherited</strong> No</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Layout</strong> Yes</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Ext.
it_it: <ul> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Default</strong> Dipendente dal Widget</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Ereditato</strong> No</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Layout</strong> Sì</li> <li style='display:inline-block; margin-right: 20px; margin-left: 0px'><strong>Ext.

source: ======= Layouts <=== Document title, seen in documentation =======
it_it: ======= Layouts <=== Titolo del documento, visibile nella documentazione =======

source: > 16 MHz clock speed is recommended
it_it: Velocità di clock consigliata >16 MHz

source: A ".bin" font file created by LVGL's Font converter from a TTF file (when ``as_file="true"``).
it_it: Un file di font ".bin" creato dal convertitore di font di LVGL da un file TTF (quando ``as_file="true"``).

source: A "Crown" is a rotary device typically found on smartwatches.
it_it: Una "Crown" [corona/rotellina] è un dispositivo rotante tipicamente presente sugli smartwatch.

source: A "Draw Task" (:cpp:type:`lv_draw_task_t`) is a package of information that is created at the beginning of the Drawing Pipeline when a request to draw is made.
it_it: Un "Draw Task" (:cpp:type:`lv_draw_task_t`) è un pacchetto di informazioni che viene creato all'inizio della Pipeline di Disegno quando viene effettuata una richiesta di disegno.

source: A "Draw Unit" (based on :cpp:type:`lv_draw_unit_t`) is any "logic entity" that can generate the output required by a :ref:`Draw Task <draw tasks>`.
it_it: Una "Draw Unit" (basata su :cpp:type:`lv_draw_unit_t`) è qualsiasi "entità logica" in grado di generare l'output richiesto da un :ref:`Draw Task <draw tasks>`.

source: A *Hardware Button* is an external button typically located next to the screen and assigned to specific coordinates on the screen.
it_it: Un *Hardware Button* è un pulsante esterno solitamente posizionato accanto allo schermo e assegnato a coordinate specifiche sullo schermo..

source: A *Path* is a function which calculates the next value to set based on the current state of the Animation.
it_it: Un *Path* è una funzione che calcola il valore successivo da impostare in base allo stato corrente dell'Animazione.

source: A *Screen* is an LVGL widget created on a *Display*.
it_it: Uno *Screen* è un widget LVGL creato su un *Display*.

source: A 30-frame animation that plays over 1 second probably has minimal issues, but a 300 frame animation playing over 10 seconds could very easily crash due to lack of memory as rlottie renders, depending on the complexity of the animation.
it_it: Un'animazione di 30 frame che dura più di 1 secondo probabilmente presenta problemi minimi, ma un'animazione di 300 frame che dura più di 10 secondi potrebbe facilmente bloccarsi a causa della mancanza di memoria durante il rendering di rlottie, a seconda della complessità dell'animazione.

source: A C compiler: gcc for Linux, clang for OSX and MSVC for Windows
it_it: Un compilatore C: gcc per Linux, clang per OSX e MSVC per Windows

source: A C++20 library for parsing glTF files (https://github.com/spnda/fastgltf)
it_it: Una libreria C++20 per il parsing dei file glTF (https://github.com/spnda/fastgltf)

source: A Canvas inherits from :ref:`Image <lv_image>` and extends it, enabling the user to draw anything.
it_it: Un Canvas eredita da :ref:`Image <lv_image>` e lo estende, consentendo all'utente di disegnare qualsiasi cosa.

source: A DDR4 SODIMM edge connector provides a cost-effective, highly reliable, shock- and vibration-resistant connection.
it_it: Un connettore edge SODIMM DDR4 offre una connessione conveniente, altamente affidabile e resistente a urti e vibrazioni.
